In [1]:
import pandas as pd

In [11]:
scores = pd.DataFrame({'Math': [4,2,3], 'Reading': [4,4,4]}, index=['Alice', 'Croft', 'Claudia'])

In [12]:
scores

         Math  Reading
Alice       4        4
Croft       2        4
Claudia     3        4

In [22]:
scores = pd.DataFrame({'Math': {'Alice':4, 'Croft': 2, 'Claudia': 3}, 
                       'Reading': {'Alice': 3, 'Croft': 4, 'Doloris': 4}})

In [23]:
scores

         Math  Reading
Alice     4.0      3.0
Croft     2.0      4.0
Claudia   3.0      NaN
Doloris   NaN      4.0

In [29]:
scores.mean(axis=0)

Math       3.000000
Reading    3.666667
dtype: float64

In [28]:
scores.mean(axis=1)

Alice      3.5
Croft      3.0
Claudia    3.0
Doloris    4.0
dtype: float64

In [30]:
scores['average'] = scores.mean(axis=1)

In [31]:
scores

         Math  Reading  average
Alice     4.0      3.0      3.5
Croft     2.0      4.0      3.0
Claudia   3.0      NaN      3.0
Doloris   NaN      4.0      4.0

In [32]:
scores.Math

Alice      4.0
Croft      2.0
Claudia    3.0
Doloris    NaN
Name: Math, dtype: float64

In [33]:
scores['Writing'] = [2,2,2,2]

In [35]:
del scores['average']

In [36]:
scores

         Math  Reading  Writing
Alice     4.0      3.0        2
Croft     2.0      4.0        2
Claudia   3.0      NaN        2
Doloris   NaN      4.0        2